### Student management system

Student Management System (SMS), is designed to store relational database with multiple tables. Each table will store related data, and these tables will be connected using foreign keys.
Here are tables that are used in sms.

### purpose of this system
- Efficient Management of Student Data
- Course Management
- Store Grades
- Professor and Department Management

### Tables for the Student Management System

- Students Table:  It stores personal information about the students.

- Courses Table: It stores the information about the courses.

- Enrollments Table: Connects students to the courses they are enrolled in.

- Departments Table: It stores details about different departments.

- Professors Table:It stores information about the professors who teach courses.

- Grades Table: It stores grades for students in different courses.

Students Table

- This table will store information about each student, such as their name, date of birth, and department.

In [1]:
%load_ext sql
%sql sqlite:///students.db

Students Table

- This table will store information about each student, such as their name, date of birth,Email and department.

In [2]:
%%sql
drop table if exists students;
Create table students (
    student_id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name varchar(50),
    last_name varchar(50),
    birth_date date,
    email varchar(100) unique,
    department_id int,
    foreign key (department_id) references departments(department_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Courses Table

- This table will store information about courses that are available.

In [3]:
%%sql
drop table if exists courses;
create table courses (
    course_id INTEGER PRIMARY KEY AUTOINCREMENT,
    course_name varchar(100),
    department_id int,
    professor_id int,
    foreign key (department_id) references departments(department_id),
    foreign key (professor_id) references professors(professor_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Enrollments Table

- This table will connect students with the courses they are enrolled in. It is a many-to-many relationship because one student can enroll in multiple courses and each course can have multiple students.

In [4]:
%%sql
drop table if exists enrollments;
create table enrollments (
    enrollment_id INTEGER PRIMARY KEY AUTOINCREMENT,
    student_id int,
    course_id int,
    enrollment_date date,
    grade varchar(2),
    foreign key (student_id) references students(student_id),
    foreign key (course_id) references courses(course_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Departments Table

- This table stores information about the different departments within the institution, such as Computer Science, Engineering, etc

In [5]:
%%sql
drop table if exists departments;
create table departments (
    department_id INTEGER PRIMARY KEY AUTOINCREMENT,
    department_name varchar(100)
);

 * sqlite:///students.db
Done.
Done.

[]

 Professors Table

- This table will store information about the professors who teach the courses.

In [6]:
%%sql
drop table if exists professors;
create table professors (
    professor_id INTEGER PRIMARY KEY  AUTOINCREMENT,
    first_name varchar(50),
    last_name varchar(50),  
    department_id int,
    foreign key (department_id) references departments(department_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Grades Table

- This table will store the grades that students get in each course they are enrolled in.

In [7]:
%%sql
drop table if exists grades;
create table grades (
    grade_id INTEGER PRIMARY KEY AUTOINCREMENT,
    student_id int,
    course_id int,
    grade varchar(2),
    foreign key (student_id) references students(student_id),
    foreign key (course_id) references courses(course_id)   
);

 * sqlite:///students.db
Done.
Done.

[]

Inserting Data into Table students.

In [8]:
%%sql
INSERT INTO students (student_id,first_name, last_name, birth_date, email, department_id)
VALUES
(101,'John', 'Rai', '2000-05-14', 'john.rai@example.com', 1),
(102,'Raj', 'Sharma', '1999-08-22', 'raj@example.com', 2),
(103,'Anita', 'Adhikari', '2001-11-30', 'anita@example.com', 1),
(104,'Sita', 'Koirala', '2000-02-10', 'sita@example.com', 3),
(105,'Maya', 'Thapa', '1998-12-05', 'maya@example.com', 2),
(106,'Ramesh', 'Gurung', '1999-07-19', 'ramesh@example.com', 1),
(107,'Laxmi', 'Shrestha', '2001-03-25', 'laxmi@example.com', 3);

 * sqlite:///students.db
7 rows affected.

[]

Inserting Data into Table Course

In [9]:
%%sql
INSERT INTO courses (course_id,course_name, department_id, professor_id)
VALUES(1002,'Operating Systems', 1, 2),
      (1003,'Database Systems', 2, 3),
      (1004,'Computer Networks', 1, 1),
      (1005,'Software Engineering', 3, 4),
      (1006,'E-Commerce', 2, 2),
      (1007,'Web Technology', 3, 3);

 * sqlite:///students.db
6 rows affected.

[]

Inserting Data into table enrollment

In [10]:
%%sql
INSERT INTO enrollments (enrollment_id, student_id, course_id, enrollment_date, grade)
VALUES(1001, 101, 1001, '2022-01-10', 'A'),
      (1002, 102, 1002, '2022-01-12', 'B+'),
      (1003, 103, 1003, '2022-01-15', 'A'),
      (1004, 104, 1004, '2022-01-20', 'A'),
      (1005, 105, 1005, '2022-01-22', 'B'),
      (1006, 106, 1006, '2022-01-25', 'C+'),
      (1007, 107, 1007, '2022-01-28', 'B');

 * sqlite:///students.db
7 rows affected.

[]

Inserting data into department table

In [11]:
%%sql
INSERT INTO departments (department_id, department_name)
VALUES
    (1, 'Computer Science'),
    (2, 'Information Technology'),
    (3, 'Data Science');

 * sqlite:///students.db
3 rows affected.

[]

Inserting data into professor table

In [12]:
%%sql
INSERT INTO professors (professor_id, first_name, last_name, department_id)
VALUES
    (1, 'Rahul', 'Thapa', 1),
    (2, 'Jenisha', 'rai', 2),
    (3, 'Anil', 'Khadka', 3),
    (4, 'Manish', 'Rawal',2 ),
    (5, 'Suman', 'Gurung',1 ),
    (6, 'Kiran', 'Shrestha',3 );

 * sqlite:///students.db
6 rows affected.

[]

Inserting data into grade table

In [13]:
%%sql
INSERT INTO grades (grade_id, student_id, course_id, grade)
VALUES (101, 101, 1002, 'A'),
    (102, 102, 1003, 'B'),
    (103, 103, 1004, 'A'),
    (104, 104, 1005, 'A'),
    (105, 105, 1006, 'C'),
    (106, 106, 1007, 'B');

 * sqlite:///students.db
6 rows affected.

[]

SQL Filter Operations (Using the WHERE Clause)

The WHERE clause in SQL is used to filter records based on specific conditions. It is commonly used to extract only those records that meet certain 
condition.

Here some operations like comparisons, logical conditions will perform.

In [14]:
%%sql
SELECT * 
FROM students 
WHERE department_id = 1;

 * sqlite:///students.db
Done.

[(101, 'John', 'Rai', '2000-05-14', 'john.rai@example.com', 1),
 (103, 'Anita', 'Adhikari', '2001-11-30', 'anita@example.com', 1),
 (106, 'Ramesh', 'Gurung', '1999-07-19', 'ramesh@example.com', 1)]

In [15]:
%%sql
select * 
from courses
where department_id = 2;

 * sqlite:///students.db
Done.

[(1003, 'Database Systems', 2, 3), (1006, 'E-Commerce', 2, 2)]

In [16]:
%%sql
select first_name, last_name,department_id
from professors
where department_id = 1;

 * sqlite:///students.db
Done.

[('Rahul', 'Thapa', 1), ('Suman', 'Gurung', 1)]

### SQL JOINs

In SQL, a JOIN is used to combine rows from two or more tables based on a related column between them. Joins allow us to retrieve data from multiple tables in a relational database.
- Sometimes, important information is spread across multiple lists or tables. JOIN allows us to combine these lists to make sense of the full picture.

Different types of JOINs:

- INNER JOIN:It show only the information where there is a match in both tables.

- LEFT JOIN:It shows all rows from the left table, and the matching rows from the right table. If there’s no match, it still shows the left table’s data with NULL for the right table.

- RIGHT JOIN:It shows all rows from the right table, and the matching rows from the left table. If there’s no match, it shows NULL for the left table’s data.

- FULL JOIN:It shows all rows from both tables. If there’s no match, it shows NULL for the missing data from the other table.

In [17]:
%%sql
select first_name, last_name,department_name
from professors 
 join departments
on professors.department_id = departments.department_id;

 * sqlite:///students.db
Done.

[('Rahul', 'Thapa', 'Computer Science'),
 ('Jenisha', 'rai', 'Information Technology'),
 ('Anil', 'Khadka', 'Data Science'),
 ('Manish', 'Rawal', 'Information Technology'),
 ('Suman', 'Gurung', 'Computer Science'),
 ('Kiran', 'Shrestha', 'Data Science')]

Applying inner join to retrive matching data

In [18]:
%%sql
select first_name, last_name,department_name
from students
inner join departments
on students.department_id = departments.department_id;

 * sqlite:///students.db
Done.

[('John', 'Rai', 'Computer Science'),
 ('Raj', 'Sharma', 'Information Technology'),
 ('Anita', 'Adhikari', 'Computer Science'),
 ('Sita', 'Koirala', 'Data Science'),
 ('Maya', 'Thapa', 'Information Technology'),
 ('Ramesh', 'Gurung', 'Computer Science'),
 ('Laxmi', 'Shrestha', 'Data Science')]

In [19]:
%%sql
select first_name,last_name,grade
from students
inner join grades
on students.student_id = grades.grade_id;

 * sqlite:///students.db
Done.

[('John', 'Rai', 'A'),
 ('Raj', 'Sharma', 'B'),
 ('Anita', 'Adhikari', 'A'),
 ('Sita', 'Koirala', 'A'),
 ('Maya', 'Thapa', 'C'),
 ('Ramesh', 'Gurung', 'B')]

In [20]:
%%sql
select first_name, last_name,enrollment_date
from students
inner join enrollments
on students.student_id = enrollments.student_id;

 * sqlite:///students.db
Done.

[('John', 'Rai', '2022-01-10'),
 ('Raj', 'Sharma', '2022-01-12'),
 ('Anita', 'Adhikari', '2022-01-15'),
 ('Sita', 'Koirala', '2022-01-20'),
 ('Maya', 'Thapa', '2022-01-22'),
 ('Ramesh', 'Gurung', '2022-01-25'),
 ('Laxmi', 'Shrestha', '2022-01-28')]

In [21]:
%%sql
select s.first_name, s.last_name, c.course_name
from students s
inner join enrollments e on s.student_id = e.student_id
inner join courses c on e.course_id = c.course_id;

 * sqlite:///students.db
Done.

[('Raj', 'Sharma', 'Operating Systems'),
 ('Anita', 'Adhikari', 'Database Systems'),
 ('Sita', 'Koirala', 'Computer Networks'),
 ('Maya', 'Thapa', 'Software Engineering'),
 ('Ramesh', 'Gurung', 'E-Commerce'),
 ('Laxmi', 'Shrestha', 'Web Technology')]

- Left Joins:Return all rows from left table and only matching from right table

In [22]:
%%sql
select first_name, last_name,department_name,professors.department_id
from professors 
left join departments
on professors.department_id = departments.department_id;

 * sqlite:///students.db
Done.

[('Rahul', 'Thapa', 'Computer Science', 1),
 ('Jenisha', 'rai', 'Information Technology', 2),
 ('Anil', 'Khadka', 'Data Science', 3),
 ('Manish', 'Rawal', 'Information Technology', 2),
 ('Suman', 'Gurung', 'Computer Science', 1),
 ('Kiran', 'Shrestha', 'Data Science', 3)]

In [23]:
%%sql
select first_name, last_name,course_name,courses.professor_id
from professors 
left join courses
on professors.professor_id = courses.professor_id;

 * sqlite:///students.db
Done.

[('Rahul', 'Thapa', 'Computer Networks', 1),
 ('Jenisha', 'rai', 'E-Commerce', 2),
 ('Jenisha', 'rai', 'Operating Systems', 2),
 ('Anil', 'Khadka', 'Database Systems', 3),
 ('Anil', 'Khadka', 'Web Technology', 3),
 ('Manish', 'Rawal', 'Software Engineering', 4),
 ('Suman', 'Gurung', None, None),
 ('Kiran', 'Shrestha', None, None)]

In [24]:
%%sql
select * from professors;

 * sqlite:///students.db
Done.

[(1, 'Rahul', 'Thapa', 1),
 (2, 'Jenisha', 'rai', 2),
 (3, 'Anil', 'Khadka', 3),
 (4, 'Manish', 'Rawal', 2),
 (5, 'Suman', 'Gurung', 1),
 (6, 'Kiran', 'Shrestha', 3)]

In [25]:
%%sql
select * from courses;

 * sqlite:///students.db
Done.

[(1002, 'Operating Systems', 1, 2),
 (1003, 'Database Systems', 2, 3),
 (1004, 'Computer Networks', 1, 1),
 (1005, 'Software Engineering', 3, 4),
 (1006, 'E-Commerce', 2, 2),
 (1007, 'Web Technology', 3, 3)]

In [26]:
%%sql 
select * from courses
inner join professors
on courses.professor_id = professors.professor_id;

 * sqlite:///students.db
Done.

[(1002, 'Operating Systems', 1, 2, 2, 'Jenisha', 'rai', 2),
 (1003, 'Database Systems', 2, 3, 3, 'Anil', 'Khadka', 3),
 (1004, 'Computer Networks', 1, 1, 1, 'Rahul', 'Thapa', 1),
 (1005, 'Software Engineering', 3, 4, 4, 'Manish', 'Rawal', 2),
 (1006, 'E-Commerce', 2, 2, 2, 'Jenisha', 'rai', 2),
 (1007, 'Web Technology', 3, 3, 3, 'Anil', 'Khadka', 3)]

In [27]:
%%sql
SELECT students.first_name, students.last_name, courses.course_name, grades.grade
FROM grades
JOIN students ON grades.student_id = students.student_id
JOIN courses ON grades.course_id = courses.course_id;

 * sqlite:///students.db
Done.

[('John', 'Rai', 'Operating Systems', 'A'),
 ('Raj', 'Sharma', 'Database Systems', 'B'),
 ('Anita', 'Adhikari', 'Computer Networks', 'A'),
 ('Sita', 'Koirala', 'Software Engineering', 'A'),
 ('Maya', 'Thapa', 'E-Commerce', 'C'),
 ('Ramesh', 'Gurung', 'Web Technology', 'B')]

Using Group by:

In [28]:
%%sql
SELECT departments.department_name, COUNT(students.student_id) AS student_count
FROM departments
LEFT JOIN students ON departments.department_id = students.department_id
GROUP BY departments.department_id;

 * sqlite:///students.db
Done.

[('Computer Science', 3), ('Information Technology', 2), ('Data Science', 2)]